<template>
  <div style="width: 100%; position: fixed; top: 0; background-color: white; z-index: 100">
    <header-tag></header-tag>
  </div>
  <body style="background: #f0f0f0; min-height: 1150px;align-items: center;justify-content: center;">
  <div class="contentcontainer" style="width: 100%">
    <div class="contentdiv">
      <div style="margin-bottom: 20px">
        <el-card class="article-card">
          <template #header>
            <span class="article-title">{{articles[index].header}}</span>
            <div style="display: flex">
              <el-button  class="button1"  round @click="dialogVisible=true" style="width:80px; height:32px">
                分享
                <p style="width: 6px"></p>
                <svg t="1703441357473" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2423" width="18" height="18"><path d="M1014.88968 411.786477l-364.412811-400.854093c-14.576512-14.576512-36.441281-14.576512-51.017794 0C584.882562 25.508897 584.882562 32.797153 584.882562 47.373665l0 211.359431c-298.818505 0-583.060498 247.800712-583.060498 546.619217 0 80.170819 36.441281 182.206406 72.882562 218.647687 43.729537-225.935943 269.66548-400.854093 510.177936-400.854093 0 21.864769 0 218.647687 0 218.647687 0 7.288256 0 14.576512 7.288256 29.153025 14.576512 14.576512 43.729537 7.288256 51.017794 0l364.412811-393.565836C1022.177936 462.80427 1022.177936 448.227758 1022.177936 440.939502 1022.177936 433.651246 1022.177936 419.074733 1014.88968 411.786477z" p-id="2424"></path></svg>
              </el-button>
              <svg t="1703442211250" style="margin: 7px" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="7644" width="34" height="34"><path d="M511.09761 957.257c-80.159 0-153.737-25.019-201.11-62.386-24.057 6.702-54.831 17.489-74.252 30.864-16.617 11.439-14.546 23.106-11.55 27.816 13.15 20.689 225.583 13.211 286.912 6.767v-3.061z" fill="#FAAD08" p-id="7645"></path><path d="M496.65061 957.257c80.157 0 153.737-25.019 201.11-62.386 24.057 6.702 54.83 17.489 74.253 30.864 16.616 11.439 14.543 23.106 11.55 27.816-13.15 20.689-225.584 13.211-286.914 6.767v-3.061z" fill="#FAAD08" p-id="7646"></path><path d="M497.12861 474.524c131.934-0.876 237.669-25.783 273.497-35.34 8.541-2.28 13.11-6.364 13.11-6.364 0.03-1.172 0.542-20.952 0.542-31.155C784.27761 229.833 701.12561 57.173 496.64061 57.162 292.15661 57.173 209.00061 229.832 209.00061 401.665c0 10.203 0.516 29.983 0.547 31.155 0 0 3.717 3.821 10.529 5.67 33.078 8.98 140.803 35.139 276.08 36.034h0.972z" fill="#000000" p-id="7647"></path><path d="M860.28261 619.782c-8.12-26.086-19.204-56.506-30.427-85.72 0 0-6.456-0.795-9.718 0.148-100.71 29.205-222.773 47.818-315.792 46.695h-0.962C410.88561 582.017 289.65061 563.617 189.27961 534.698 185.44461 533.595 177.87261 534.063 177.87261 534.063 166.64961 563.276 155.56661 593.696 147.44761 619.782 108.72961 744.168 121.27261 795.644 130.82461 796.798c20.496 2.474 79.78-93.637 79.78-93.637 0 97.66 88.324 247.617 290.576 248.996a718.01 718.01 0 0 1 5.367 0C708.80161 950.778 797.12261 800.822 797.12261 703.162c0 0 59.284 96.111 79.783 93.637 9.55-1.154 22.093-52.63-16.623-177.017" fill="#000000" p-id="7648"></path><path d="M434.38261 316.917c-27.9 1.24-51.745-30.106-53.24-69.956-1.518-39.877 19.858-73.207 47.764-74.454 27.875-1.224 51.703 30.109 53.218 69.974 1.527 39.877-19.853 73.2-47.742 74.436m206.67-69.956c-1.494 39.85-25.34 71.194-53.24 69.956-27.888-1.238-49.269-34.559-47.742-74.435 1.513-39.868 25.341-71.201 53.216-69.974 27.909 1.247 49.285 34.576 47.767 74.453" fill="#FFFFFF" p-id="7649"></path><path d="M683.94261 368.627c-7.323-17.609-81.062-37.227-172.353-37.227h-0.98c-91.29 0-165.031 19.618-172.352 37.227a6.244 6.244 0 0 0-0.535 2.505c0 1.269 0.393 2.414 1.006 3.386 6.168 9.765 88.054 58.018 171.882 58.018h0.98c83.827 0 165.71-48.25 171.881-58.016a6.352 6.352 0 0 0 1.002-3.395c0-0.897-0.2-1.736-0.531-2.498" fill="#FAAD08" p-id="7650"></path><path d="M467.63161 256.377c1.26 15.886-7.377 30-19.266 31.542-11.907 1.544-22.569-10.083-23.836-25.978-1.243-15.895 7.381-30.008 19.25-31.538 11.927-1.549 22.607 10.088 23.852 25.974m73.097 7.935c2.533-4.118 19.827-25.77 55.62-17.886 9.401 2.07 13.75 5.116 14.668 6.316 1.355 1.77 1.726 4.29 0.352 7.684-2.722 6.725-8.338 6.542-11.454 5.226-2.01-0.85-26.94-15.889-49.905 6.553-1.579 1.545-4.405 2.074-7.085 0.242-2.678-1.834-3.786-5.553-2.196-8.135" fill="#000000" p-id="7651"></path><path d="M504.33261 584.495h-0.967c-63.568 0.752-140.646-7.504-215.286-21.92-6.391 36.262-10.25 81.838-6.936 136.196 8.37 137.384 91.62 223.736 220.118 224.996H506.48461c128.498-1.26 211.748-87.612 220.12-224.996 3.314-54.362-0.547-99.938-6.94-136.203-74.654 14.423-151.745 22.684-215.332 21.927" fill="#FFFFFF" p-id="7652"></path><path d="M323.27461 577.016v137.468s64.957 12.705 130.031 3.91V591.59c-41.225-2.262-85.688-7.304-130.031-14.574" fill="#EB1C26" p-id="7653"></path><path d="M788.09761 432.536s-121.98 40.387-283.743 41.539h-0.962c-161.497-1.147-283.328-41.401-283.744-41.539l-40.854 106.952c102.186 32.31 228.837 53.135 324.598 51.926l0.96-0.002c95.768 1.216 222.4-19.61 324.6-51.924l-40.855-106.952z" fill="#EB1C26" p-id="7654"></path></svg>
              <svg t="1703442130370" style="margin: 7px" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4521" width="34" height="34"><path d="M683.058 364.695c11 0 22 1.016 32.943 1.976C686.564 230.064 538.896 128 370.681 128c-188.104 0.66-342.237 127.793-342.237 289.226 0 93.068 51.379 169.827 136.725 229.256L130.72 748.43l119.796-59.368c42.918 8.395 77.37 16.79 119.742 16.79 11 0 21.46-0.48 31.914-1.442a259.168 259.168 0 0 1-10.455-71.358c0.485-148.002 128.744-268.297 291.403-268.297l-0.06-0.06z m-184.113-91.992c25.99 0 42.913 16.79 42.913 42.575 0 25.188-16.923 42.579-42.913 42.579-25.45 0-51.38-16.85-51.38-42.58 0-25.784 25.93-42.574 51.38-42.574z m-239.544 85.154c-25.384 0-51.374-16.85-51.374-42.58 0-25.784 25.99-42.574 51.374-42.574 25.45 0 42.918 16.79 42.918 42.575 0 25.188-16.924 42.579-42.918 42.579z m736.155 271.655c0-135.647-136.725-246.527-290.983-246.527-162.655 0-290.918 110.88-290.918 246.527 0 136.128 128.263 246.587 290.918 246.587 33.972 0 68.423-8.395 102.818-16.85l93.809 50.973-25.93-84.677c68.907-51.93 120.286-119.815 120.286-196.033z m-385.275-42.58c-16.923 0-34.452-16.79-34.452-34.179 0-16.79 17.529-34.18 34.452-34.18 25.99 0 42.918 16.85 42.918 34.18 0 17.39-16.928 34.18-42.918 34.18z m188.165 0c-16.984 0-33.972-16.79-33.972-34.179 0-16.79 16.927-34.18 33.972-34.18 25.93 0 42.913 16.85 42.913 34.18 0 17.39-16.983 34.18-42.913 34.18z" fill="#09BB07" p-id="4522"></path></svg>
              <svg t="1703442297185" style="margin: 7px" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1281" width="34" height="34"><path d="M652.189 114.635s-55.86-22.614-140.234-22.614c-84.37 0-140.23 25.903-140.23 25.903l280.549 285.449-0.085-288.738z" fill="#FB5453" p-id="1282"></path><path d="M811.202 217.796c-61.928-58.727-121.8-79.649-121.8-79.649l-2.06 392.072 210.411-199.332c0 0.085-24.535-54.364-86.55-113.09z" fill="#6468F1" p-id="1283"></path><path d="M906.498 368.778L617.205 645.535h292.667s22.95-55.119 22.95-138.419c-0.087-83.215-26.324-138.338-26.324-138.338z" fill="#5283F0" p-id="1284"></path><path d="M696.62 887.697s56.813-22.842 118.033-80.602c61.223-57.757 83.1-113.488 83.1-113.488l-409.132-1.946L696.62 887.697z" fill="#00B2FE" p-id="1285"></path><path d="M371.806 911.213s55.864 22.61 140.234 22.61c84.455 0 140.234-25.902 140.234-25.902l-280.548-285.45 0.08 288.742z" fill="#66D020" p-id="1286"></path><path d="M224.484 808.047c61.934 58.732 121.806 79.65 121.806 79.65l2.057-392.072-210.411 199.33c0.084-0.08 24.619 54.365 86.548 113.092z" fill="#9AD122" p-id="1287"></path><path d="M114.134 368.778s-22.956 55.107-22.956 138.378c0 83.276 26.244 138.379 26.244 138.379l289.372-276.672h-292.66v-0.085z" fill="#FFC71A" p-id="1288"></path><path d="M339.07 138.147s-56.814 22.843-118.034 80.6c-61.222 57.758-83.1 113.494-83.1 113.494l409.132 1.942L339.07 138.147z" fill="#FF7612" p-id="1289"></path></svg>
              <svg t="1703442251145" style="margin: 7px" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1076" width="34" height="34"><path d="M851.4 590.193c-22.196-66.233-90.385-90.422-105.912-91.863-15.523-1.442-29.593-9.94-19.295-27.505 10.302-17.566 29.304-68.684-7.248-104.681-36.564-36.14-116.512-22.462-173.094 0.866-56.434 23.327-53.39 7.055-51.65-8.925 1.89-16.848 32.355-111.02-60.791-122.395C311.395 220.86 154.85 370.754 99.572 457.15 16 587.607 29.208 675.873 29.208 675.873h0.58c10.009 121.819 190.787 218.869 412.328 218.869 190.5 0 350.961-71.853 398.402-169.478 0 0 0.143-0.433 0.575-1.156 4.938-10.506 8.71-21.168 11.035-32.254 6.668-26.205 11.755-64.215-0.728-101.66z m-436.7 251.27c-157.71 0-285.674-84.095-285.674-187.768 0-103.671 127.82-187.76 285.674-187.76 157.705 0 285.673 84.089 285.673 187.76 0 103.815-127.968 187.768-285.673 187.768z" fill="#E71F19" p-id="1077"></path><path d="M803.096 425.327c2.896 1.298 5.945 1.869 8.994 1.869 8.993 0 17.7-5.328 21.323-14.112 5.95-13.964 8.993-28.793 8.993-44.205 0-62.488-51.208-113.321-114.181-113.321-15.379 0-30.32 3.022-44.396 8.926-11.755 4.896-17.263 18.432-12.335 30.24 4.933 11.662 18.572 17.134 30.465 12.238 8.419-3.46 17.268-5.33 26.41-5.33 37.431 0 67.752 30.241 67.752 67.247 0 9.068-1.735 17.857-5.369 26.202a22.832 22.832 0 0 0 12.335 30.236l0.01 0.01z" fill="#F5AA15" p-id="1078"></path><path d="M726.922 114.157c-25.969 0-51.65 3.744-76.315 10.942-18.423 5.472-28.868 24.622-23.5 42.91 5.509 18.29 24.804 28.657 43.237 23.329a201.888 201.888 0 0 1 56.578-8.064c109.253 0 198.189 88.271 198.189 196.696 0 19.436-2.905 38.729-8.419 57.16-5.508 18.289 4.79 37.588 23.212 43.053 3.342 1.014 6.817 1.442 10.159 1.442 14.943 0 28.725-9.648 33.37-24.48 7.547-24.906 11.462-50.826 11.462-77.175-0.143-146.588-120.278-265.813-267.973-265.813z" fill="#F5AA15" p-id="1079"></path><path d="M388.294 534.47c-84.151 0-152.34 59.178-152.34 132.334 0 73.141 68.189 132.328 152.34 132.328 84.148 0 152.337-59.182 152.337-132.328 0-73.15-68.19-132.334-152.337-132.334zM338.53 752.763c-29.454 0-53.39-23.755-53.39-52.987 0-29.228 23.941-52.989 53.39-52.989 29.453 0 53.39 23.76 53.39 52.989 0 29.227-23.937 52.987-53.39 52.987z m99.82-95.465c-6.382 11.086-19.296 15.696-28.726 10.219-9.43-5.323-11.75-18.717-5.37-29.803 6.386-11.09 19.297-15.7 28.725-10.224 9.43 5.472 11.755 18.864 5.37 29.808z" fill="#040000" p-id="1080"></path></svg>

            </div>


          </template>
          <img :src="articles[index].src" class="article-img" alt="">
          <div class="article-content" style="text-indent: 2em;">
            {{ articles[index].content }}
          </div>
<!--          <p class="article-content">{{articles[index].content}}</p>-->
        </el-card>
      </div>
    </div>

    <div style="width: 48% ">
      <div style="height: 3%"></div>
      <AdvertisementCard style="margin: 50px;height: 260px;width: 90%"></AdvertisementCard>
      <div style="height: 5%"></div>
      <AdvertisementCard2 style="margin: 50px;height: 340px;width: 90%;"></AdvertisementCard2>
      <div style="height: 5%"></div>
      <more-animal-card style="margin-left: 150px"></more-animal-card>
    </div>
  </div>
  <div class="recent">
    <div class="rec-sec">
      <p class="recent-text">最近浏览过的宠物</p>
      <div class="rec-cards">
        <pet-display-card style="margin-left: 15px"  v-for="(pet, index) in pets.slice(0, 5)" :key="index" :pet="pet" />
      </div>
    </div>
  </div>
  </body>
  <el-dialog
      title="分享这篇文章"
      v-model="dialogVisible"
      width="40%">
    <footer>
      <el-button class="share">
        <svg t="1703442211250" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="7644" width="40" height="40"><path d="M511.09761 957.257c-80.159 0-153.737-25.019-201.11-62.386-24.057 6.702-54.831 17.489-74.252 30.864-16.617 11.439-14.546 23.106-11.55 27.816 13.15 20.689 225.583 13.211 286.912 6.767v-3.061z" fill="#FAAD08" p-id="7645"></path><path d="M496.65061 957.257c80.157 0 153.737-25.019 201.11-62.386 24.057 6.702 54.83 17.489 74.253 30.864 16.616 11.439 14.543 23.106 11.55 27.816-13.15 20.689-225.584 13.211-286.914 6.767v-3.061z" fill="#FAAD08" p-id="7646"></path><path d="M497.12861 474.524c131.934-0.876 237.669-25.783 273.497-35.34 8.541-2.28 13.11-6.364 13.11-6.364 0.03-1.172 0.542-20.952 0.542-31.155C784.27761 229.833 701.12561 57.173 496.64061 57.162 292.15661 57.173 209.00061 229.832 209.00061 401.665c0 10.203 0.516 29.983 0.547 31.155 0 0 3.717 3.821 10.529 5.67 33.078 8.98 140.803 35.139 276.08 36.034h0.972z" fill="#000000" p-id="7647"></path><path d="M860.28261 619.782c-8.12-26.086-19.204-56.506-30.427-85.72 0 0-6.456-0.795-9.718 0.148-100.71 29.205-222.773 47.818-315.792 46.695h-0.962C410.88561 582.017 289.65061 563.617 189.27961 534.698 185.44461 533.595 177.87261 534.063 177.87261 534.063 166.64961 563.276 155.56661 593.696 147.44761 619.782 108.72961 744.168 121.27261 795.644 130.82461 796.798c20.496 2.474 79.78-93.637 79.78-93.637 0 97.66 88.324 247.617 290.576 248.996a718.01 718.01 0 0 1 5.367 0C708.80161 950.778 797.12261 800.822 797.12261 703.162c0 0 59.284 96.111 79.783 93.637 9.55-1.154 22.093-52.63-16.623-177.017" fill="#000000" p-id="7648"></path><path d="M434.38261 316.917c-27.9 1.24-51.745-30.106-53.24-69.956-1.518-39.877 19.858-73.207 47.764-74.454 27.875-1.224 51.703 30.109 53.218 69.974 1.527 39.877-19.853 73.2-47.742 74.436m206.67-69.956c-1.494 39.85-25.34 71.194-53.24 69.956-27.888-1.238-49.269-34.559-47.742-74.435 1.513-39.868 25.341-71.201 53.216-69.974 27.909 1.247 49.285 34.576 47.767 74.453" fill="#FFFFFF" p-id="7649"></path><path d="M683.94261 368.627c-7.323-17.609-81.062-37.227-172.353-37.227h-0.98c-91.29 0-165.031 19.618-172.352 37.227a6.244 6.244 0 0 0-0.535 2.505c0 1.269 0.393 2.414 1.006 3.386 6.168 9.765 88.054 58.018 171.882 58.018h0.98c83.827 0 165.71-48.25 171.881-58.016a6.352 6.352 0 0 0 1.002-3.395c0-0.897-0.2-1.736-0.531-2.498" fill="#FAAD08" p-id="7650"></path><path d="M467.63161 256.377c1.26 15.886-7.377 30-19.266 31.542-11.907 1.544-22.569-10.083-23.836-25.978-1.243-15.895 7.381-30.008 19.25-31.538 11.927-1.549 22.607 10.088 23.852 25.974m73.097 7.935c2.533-4.118 19.827-25.77 55.62-17.886 9.401 2.07 13.75 5.116 14.668 6.316 1.355 1.77 1.726 4.29 0.352 7.684-2.722 6.725-8.338 6.542-11.454 5.226-2.01-0.85-26.94-15.889-49.905 6.553-1.579 1.545-4.405 2.074-7.085 0.242-2.678-1.834-3.786-5.553-2.196-8.135" fill="#000000" p-id="7651"></path><path d="M504.33261 584.495h-0.967c-63.568 0.752-140.646-7.504-215.286-21.92-6.391 36.262-10.25 81.838-6.936 136.196 8.37 137.384 91.62 223.736 220.118 224.996H506.48461c128.498-1.26 211.748-87.612 220.12-224.996 3.314-54.362-0.547-99.938-6.94-136.203-74.654 14.423-151.745 22.684-215.332 21.927" fill="#FFFFFF" p-id="7652"></path><path d="M323.27461 577.016v137.468s64.957 12.705 130.031 3.91V591.59c-41.225-2.262-85.688-7.304-130.031-14.574" fill="#EB1C26" p-id="7653"></path><path d="M788.09761 432.536s-121.98 40.387-283.743 41.539h-0.962c-161.497-1.147-283.328-41.401-283.744-41.539l-40.854 106.952c102.186 32.31 228.837 53.135 324.598 51.926l0.96-0.002c95.768 1.216 222.4-19.61 324.6-51.924l-40.855-106.952z" fill="#EB1C26" p-id="7654"></path></svg>
        <p style="margin-left: 12px;margin-top: 14px">QQ</p>
      </el-button>
      <el-button class="share">
        <svg t="1703442130370" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4521" width="40" height="40"><path d="M683.058 364.695c11 0 22 1.016 32.943 1.976C686.564 230.064 538.896 128 370.681 128c-188.104 0.66-342.237 127.793-342.237 289.226 0 93.068 51.379 169.827 136.725 229.256L130.72 748.43l119.796-59.368c42.918 8.395 77.37 16.79 119.742 16.79 11 0 21.46-0.48 31.914-1.442a259.168 259.168 0 0 1-10.455-71.358c0.485-148.002 128.744-268.297 291.403-268.297l-0.06-0.06z m-184.113-91.992c25.99 0 42.913 16.79 42.913 42.575 0 25.188-16.923 42.579-42.913 42.579-25.45 0-51.38-16.85-51.38-42.58 0-25.784 25.93-42.574 51.38-42.574z m-239.544 85.154c-25.384 0-51.374-16.85-51.374-42.58 0-25.784 25.99-42.574 51.374-42.574 25.45 0 42.918 16.79 42.918 42.575 0 25.188-16.924 42.579-42.918 42.579z m736.155 271.655c0-135.647-136.725-246.527-290.983-246.527-162.655 0-290.918 110.88-290.918 246.527 0 136.128 128.263 246.587 290.918 246.587 33.972 0 68.423-8.395 102.818-16.85l93.809 50.973-25.93-84.677c68.907-51.93 120.286-119.815 120.286-196.033z m-385.275-42.58c-16.923 0-34.452-16.79-34.452-34.179 0-16.79 17.529-34.18 34.452-34.18 25.99 0 42.918 16.85 42.918 34.18 0 17.39-16.928 34.18-42.918 34.18z m188.165 0c-16.984 0-33.972-16.79-33.972-34.179 0-16.79 16.927-34.18 33.972-34.18 25.93 0 42.913 16.85 42.913 34.18 0 17.39-16.983 34.18-42.913 34.18z" fill="#09BB07" p-id="4522"></path></svg>
        <p style="margin-left: 12px;margin-top: 14px">微信</p>
      </el-button>
      <el-button class="share">
        <svg t="1703442297185" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1281" width="40" height="40"><path d="M652.189 114.635s-55.86-22.614-140.234-22.614c-84.37 0-140.23 25.903-140.23 25.903l280.549 285.449-0.085-288.738z" fill="#FB5453" p-id="1282"></path><path d="M811.202 217.796c-61.928-58.727-121.8-79.649-121.8-79.649l-2.06 392.072 210.411-199.332c0 0.085-24.535-54.364-86.55-113.09z" fill="#6468F1" p-id="1283"></path><path d="M906.498 368.778L617.205 645.535h292.667s22.95-55.119 22.95-138.419c-0.087-83.215-26.324-138.338-26.324-138.338z" fill="#5283F0" p-id="1284"></path><path d="M696.62 887.697s56.813-22.842 118.033-80.602c61.223-57.757 83.1-113.488 83.1-113.488l-409.132-1.946L696.62 887.697z" fill="#00B2FE" p-id="1285"></path><path d="M371.806 911.213s55.864 22.61 140.234 22.61c84.455 0 140.234-25.902 140.234-25.902l-280.548-285.45 0.08 288.742z" fill="#66D020" p-id="1286"></path><path d="M224.484 808.047c61.934 58.732 121.806 79.65 121.806 79.65l2.057-392.072-210.411 199.33c0.084-0.08 24.619 54.365 86.548 113.092z" fill="#9AD122" p-id="1287"></path><path d="M114.134 368.778s-22.956 55.107-22.956 138.378c0 83.276 26.244 138.379 26.244 138.379l289.372-276.672h-292.66v-0.085z" fill="#FFC71A" p-id="1288"></path><path d="M339.07 138.147s-56.814 22.843-118.034 80.6c-61.222 57.758-83.1 113.494-83.1 113.494l409.132 1.942L339.07 138.147z" fill="#FF7612" p-id="1289"></path></svg>
        <p style="margin-left: 12px;margin-top: 14px">朋友圈</p>
      </el-button>
      <el-button class="share">
        <svg t="1703442251145" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1076" width="40" height="40"><path d="M851.4 590.193c-22.196-66.233-90.385-90.422-105.912-91.863-15.523-1.442-29.593-9.94-19.295-27.505 10.302-17.566 29.304-68.684-7.248-104.681-36.564-36.14-116.512-22.462-173.094 0.866-56.434 23.327-53.39 7.055-51.65-8.925 1.89-16.848 32.355-111.02-60.791-122.395C311.395 220.86 154.85 370.754 99.572 457.15 16 587.607 29.208 675.873 29.208 675.873h0.58c10.009 121.819 190.787 218.869 412.328 218.869 190.5 0 350.961-71.853 398.402-169.478 0 0 0.143-0.433 0.575-1.156 4.938-10.506 8.71-21.168 11.035-32.254 6.668-26.205 11.755-64.215-0.728-101.66z m-436.7 251.27c-157.71 0-285.674-84.095-285.674-187.768 0-103.671 127.82-187.76 285.674-187.76 157.705 0 285.673 84.089 285.673 187.76 0 103.815-127.968 187.768-285.673 187.768z" fill="#E71F19" p-id="1077"></path><path d="M803.096 425.327c2.896 1.298 5.945 1.869 8.994 1.869 8.993 0 17.7-5.328 21.323-14.112 5.95-13.964 8.993-28.793 8.993-44.205 0-62.488-51.208-113.321-114.181-113.321-15.379 0-30.32 3.022-44.396 8.926-11.755 4.896-17.263 18.432-12.335 30.24 4.933 11.662 18.572 17.134 30.465 12.238 8.419-3.46 17.268-5.33 26.41-5.33 37.431 0 67.752 30.241 67.752 67.247 0 9.068-1.735 17.857-5.369 26.202a22.832 22.832 0 0 0 12.335 30.236l0.01 0.01z" fill="#F5AA15" p-id="1078"></path><path d="M726.922 114.157c-25.969 0-51.65 3.744-76.315 10.942-18.423 5.472-28.868 24.622-23.5 42.91 5.509 18.29 24.804 28.657 43.237 23.329a201.888 201.888 0 0 1 56.578-8.064c109.253 0 198.189 88.271 198.189 196.696 0 19.436-2.905 38.729-8.419 57.16-5.508 18.289 4.79 37.588 23.212 43.053 3.342 1.014 6.817 1.442 10.159 1.442 14.943 0 28.725-9.648 33.37-24.48 7.547-24.906 11.462-50.826 11.462-77.175-0.143-146.588-120.278-265.813-267.973-265.813z" fill="#F5AA15" p-id="1079"></path><path d="M388.294 534.47c-84.151 0-152.34 59.178-152.34 132.334 0 73.141 68.189 132.328 152.34 132.328 84.148 0 152.337-59.182 152.337-132.328 0-73.15-68.19-132.334-152.337-132.334zM338.53 752.763c-29.454 0-53.39-23.755-53.39-52.987 0-29.228 23.941-52.989 53.39-52.989 29.453 0 53.39 23.76 53.39 52.989 0 29.227-23.937 52.987-53.39 52.987z m99.82-95.465c-6.382 11.086-19.296 15.696-28.726 10.219-9.43-5.323-11.75-18.717-5.37-29.803 6.386-11.09 19.297-15.7 28.725-10.224 9.43 5.472 11.755 18.864 5.37 29.808z" fill="#040000" p-id="1080"></path></svg>
        <p style="margin-left: 12px;margin-top: 14px">微博</p>
      </el-button>
    </footer>
  </el-dialog>
  <FooterCard></FooterCard>
</template>

<script>
import { ElBreadcrumb, ElBreadcrumbItem, ElCard, ElButton, ElDialog } from 'element-plus';
import HeaderTag from "@/components/HeaderTag.vue";
import FooterCard from "@/components/FooterCard.vue";
import PetDisplayCard from "@/components/PetDisplayCard.vue";
import router from "@/router";
import {request} from "@/utils/request";
import AdvertisementCard from "@/components/AdvertisementCard.vue";
import AdvertisementCard2 from "@/components/AdvertisementCard2.vue";
import MoreAnimalCard from "@/components/MoreAnimalCard.vue";
export default {
  components: {
    MoreAnimalCard,
    AdvertisementCard, PetDisplayCard, ElBreadcrumb, ElBreadcrumbItem, HeaderTag, FooterCard, ElCard, AdvertisementCard2, ElButton, ElDialog},
  data() {
    return {
      dialogVisible:false,
      articles: [
        {
          src: 'src/assets/imgs/article1.jpg',
          header: '宠物科普 | 为何人人都需要一只宠物',
          content: '相信有许多人仍无法理解领养的意义和缘由，有些人更是质疑领养需要的符合条件，甚至会认为如此高的门槛，还不如直接购买干脆。\n' +
              //'\n' +
              '首先要先了解为什么会提倡"领养代替购买"，领养有什么好处？\n' +
              '1、至少限度能减少了一只可怜的流浪猫狗，让它能重回家庭，帮助它重获新生。\n' +
              '"如果能有家，谁会愿意颠沛流离？"，哪怕是无法言喻表达的动物们，家—是它们一生的渴望！\n' +
              '2、没有买卖就没有伤害\n' +
              '被贩卖的猫狗，无非是繁殖用于卖钱的商品，它们的背后是长期被关、反复交配和生产，本体营养和寿命变成商人手中的钱，直到它们失去利用价值，再为了减少喂养成本被遗弃或杀死。而领养除了可以节省购买费用，还能避免买到有问题的商业繁殖猫狗，减少对活体猫狗繁殖买卖经济的鼓励，减少了无良繁殖场的收益，让更少的动物被关起来繁殖卖崽。\n' +
              '3、健康\n' +
              '大多数被救助的流浪动物都经过救助人的照料和治疗，待身体恢复健康后，才接受领养。\n' +
              '4、足够时间考虑\n' +
              '在领养审核过程中，有足够的时候让领养人认真考量清楚自己是否适合养宠，避免了因一时冲动后发生因各种原因而导致退却、弃养，遗弃等问题。\n' +
              '\n' +
              '为什么领养的门槛这么高呢?\n' +
              '现社会那么多的流浪猫狗基本都是人为随意遗弃抛弃等所造成的恶果，救助流浪猫狗并非易事。\n' +
              '有些流浪猫狗在被救助时，多数都是生病了受伤了，有些甚至只剩下一口气。\n' +
              '而救助人花费不小心力和金钱才把它们从生死边缘救回来。\n' +
              '而高的门槛，可以筛选出更适合的领养人，避免了一时冲动或是别有用心的领养人。\n' +
              '\n' +
              '不管是购买的还是领养的，一旦养了，请好好照顾它吧！\n' +
              '\n'
        },
        {
          src: 'src/assets/imgs/article2.png',
          header: '宠物科普 | 为何人人都需要一只宠物',
          content: '2021年，随着冬季疫情出现局部扩散，防控措施再度强化，其中，"隔离允许带宠物"的人性化政策获点赞，反映了宠物对于家庭的意义。越是在特殊时期，主人与宠物相互扶持的情谊越显重要。人宠之间的情感牵绊，支撑着彼此的生活。为何宠物对我们如此重要？不考虑源于本能的喜爱因素，宠物给我们的生活带来了哪些益处？\n' +
              '\n' +
              '从幼儿到老人，宠物无差别守护家人健康\n' +
              '养宠物如同家里多了位家人，但与此同时，宠主也要照顾其他家庭成员的需求，上到银发苍苍的老人，下到蹒跚学步的婴儿，是否会因养宠造成困扰？比如不少家庭在女主人怀孕后会送走宠物。这种做法其实源于错误的认知。大部分人选择养宠时，可能并未意识到宠物对家人健康的积极影响。大量的科学研究已证实，宠物在改善人类体质、降低患病风险、促进长寿等方面发挥了巨大能量。\n' +
              '\n' +
              '加拿大艾伯塔大学一项最新研究显示，一些养狗家庭的婴儿患过敏性疾病和肥胖症的几率更低。研究人员采样发现，从母亲怀孕到婴儿3个月期间，家中有宠物的婴儿，肠道内瘤胃球菌和颤螺菌数量会增加，这两种有益菌来自宠物身上，可分别降低儿童过敏性疾病和肥胖症的风险。\n' +
              '\n' +
              '瑞典一项始于2001年的长期跟踪研究发现，养狗的主人患心血管病几率较低。家中至少有一只狗的主人罹患心脏病死亡的概率比独居者少33%，患心血管疾病风险降低了36%。美国明尼苏达大学一项研究结果显示，养猫的人遭遇致命心脏病发作的几率比不养猫的人低40％。美国加州大学、斯坦福大学研究人员发现，经常和狗在一起，能增强免疫力，患非霍奇金淋巴瘤的风险降低30%。\n' +
              '\n' +
              '养宠改变了宠主的生活与社交方式，尤其是活泼好动的狗，帮助主人告别宅居习惯，增加户外活动、健走等频次，同时纾解了压力，进而降低主人罹患疾病的风险，养宠者因此更长寿，生活品质更高。从幼儿到老人，都能获得宠物的守护。\n' +
              '\n' +
              '高压时代，找到治愈心灵的情绪良药\n' +
              '当下，每个人都处在巨大的压力旋涡中，竞争氛围不仅存在于成年人之间，也蔓延至年纪更小的青少年群体，每个家庭背负着焦虑拼命催娃奋进。由此造成系列社会问题，儿童心理问题频发。成人和孩子，都需要治愈。宠物，是最易觅得的一剂情绪良药。\n' +
              '\n' +
              '《儿科研究》（Pediatric Research）上的一项研究显示，养狗家庭的幼童社交与情绪健康状况优于未养狗家庭中的幼童。相较之下，前者比后者在情绪和社交互动上遇到困难的几率低23%，出现反社会行为的几率低30%，与其他孩子互动出现问题的几率低40%，而表现出友好社交行为的几率高34%。\n' +
              '\n' +
              '众多研究表明，宠物可以帮助儿童培养责任感、同理心和独立性格，发展语言技能、社交技能等，还会塑造其自尊、自信、善良、信任等品质。\n' +
              '对于处于压力风暴中的成年人而言，宠物是黯淡的重压生活中一抹亮色，可以帮助自己排遣孤独感，消解压力与负面情绪，改善睡眠质量，甚至改变情绪障碍、抑郁、自卑等，找到生活的平衡感与幸福感。\n' +
              '\n' +
              '宠物是人类身心健康的忠实卫士，我们需要它们的陪伴。它们，让生活更美好，值得被更好地对待。\n' +
              '\n'
        },
        {
          src: 'src/assets/imgs/article3.jpg',
          header: '如果决定接纳一条生命，就请陪它一生',
          content: '随着中国经济的增长，宠物行业得到了迅猛的发展，人们饲养宠物已经由单纯的玩赏而转变成人们精神的一种寄托，宠物的角色也悄然发生着变化，已经日益成为人们生活的伴侣，在促进和谐社会发挥着不可替代的调节作用，越来越多的人开始养宠物，其中以猫狗为主。2019年，全国犬猫养宠人数达6120万人。\n' +
              '\n' +
              '看着身边的朋友同事都拥有属于自己的宠物，你是不是在心里蠢蠢欲动。\n' +
              '\n' +
              '可是，你在带它回家前，所有的问题，都周密地考虑清楚了么？\n' +
              '\n' +
              '领养前的准备:\n' +
              '1.明确内心想要领养的真正原因\n' +
              '●你是觉得网上的宠物很好玩还是真的想养一只宠物作为陪伴，一定要想清楚。领养最怕三分钟热度和反悔。\n' +
              '●你是觉得别人都有宠物自己也应该有一只，还是看到别人发的宠物十分有趣，很好玩呢？还是真的需要和它成为家人与它为伴？\n' +
              '（领养最忌讳的是不负责任的一时兴起）\n' +
              '\n' +
              '2.如果你已知确认想给小流浪一个永远的家，你需要知道\n' +
              '●你有固定的居所以及稳定经济来源，承担起你们彼此的日常开销。\n' +
              '●你愿意和它成为家人，从今天开始相互拥有，相互陪伴，无论是好是坏、富裕或贫穷、疾病还是健康都彼此珍惜，你要对它不离不弃，善始善终。\n' +
              '●你的家庭成员支持与你一同照顾它，不会因为它的到来产生家庭纠纷与矛盾。\n' +
              '●家里拥有足够合适空间给予它活动。\n' +
              '●你的工作不会影响对它正常的照顾。\n' +
              '●你确定不因出差，旅游，工作调动，结婚，生子，过年回家，家庭住址变迁等因素将它弃养。\n' +
              '●你知道它性格或不良习惯可能会造成你生活的麻烦，你有耐心对它进行指导纠正它的行为习惯。\n' +
              '●你了解它会生病，并确定有能力并愿意支付可能的医疗费用。\n' +
              '●它和你一样害怕孤单，在你丰富的生活中，你确定不会因为社交而将它冷落。\n' +
              '\n' +
              '3.你对猫猫狗狗都有哪些基本了解呢？\n' +
              '▲家养的狗狗平均寿命是10-15年，猫咪平均寿命13-17年。\n' +
              '▲小型犬相较于大型犬性格更活泼好动，比较爱叫。\n' +
              '▲1岁以前它们对所有事物充满好奇，是个拆家小能手。还没养成固定习惯前，他们可能会在家里随处大小便。\n' +
              '▲住在楼层高的养猫家长需要时刻注意窗户是否关严，安全措施是否做好。许多猫咪由于高空坠楼导致死亡的案件屡屡发生。\n' +
              '▲即使再乖的狗狗出门一定系好牵引绳，百分之90遭到车祸的狗狗，家长都以为它们非常听话并且不会乱跑。其中占比最大的品种是泰迪犬。\n' +
              '▲它们不能吃过咸的食物，否则会增加肾脏负担，影响身体健康。\n' +
              '▲它们需要定期驱虫及免疫，否则容易因抵抗力不够而生病。\n' +
              '▲猫咪相较狗狗更敏感，易发生应激。寄养，洗澡，搬家，家里有到访者，有其他宠物进入家庭，很容易对猫产生影响。\n' +
              '▲它们成年后如果没有繁殖计划尽早做绝育。避免患上生理方面疾病。\n' +
              '▲狗狗不能吃不经处理的禽类骨头，尖而硬的骨头非常容易将肠道划伤。\n' +
              '▲养猫家庭需要给猫咪配备猫抓板，它们可以通过磨爪行为缓解压力。\n' +
              '▲相对于吃什么价位的粮食存在争议，它们的食盆卫生更应该引起注意，需要每日清洗，避免因残留粮食放置时间长产生黄曲霉素危害宠物健康。\n' +
              '▲猫咪怕冷，家长一定注意天气变化给它们做好保暖工作。\n' +
              '▲许多城市推行养狗家庭办理养犬证政策，家长不要忽视，请配合办理。\n' +
              '▲它们的正常体温基本在38-39摄氏度之间，它们一旦出现精神不振，食欲不佳，嗜睡等情况，请及时为它们测量体温，并联系兽医进行看诊。\n' +
              '\n' +
              '杜绝因"时尚"，"所见所闻"而领养。这些领养的原因很大可能会在热度后将其抛弃。\n' +
              '\n' +
              '一时的兴起只因为你处于看到"美好一面"的时刻，但它们终有"不足"。\n' +
              '\n' +
              '这些"不足"能被你包容和接纳，才是领养必备心理要素。\n' +
              '\n' +
              '它们可能没有其他孩子幸运\n' +
              '\n' +
              '一出生就锦衣玉食\n' +
              '\n' +
              '还好和你相遇\n' +
              '\n' +
              '让它们获得新生\n' +
              '\n' +
              '谢谢你为它们给予的爱和帮助。'
        }

      ],
      pets: [],
      recent_pets: [
        {id: 1, name: '猫猫1', age: "6岁", location: '南京', imageUrl: 'src/views/assets/img/cat1.jpg'},
        {id: 2, name: '猫猫2', age: "6岁", location: '南京', imageUrl: 'src/views/assets/img/cat1.jpg'},
        {id: 3, name: '猫猫3', age: "6岁", location: '南京', imageUrl: 'src/views/assets/img/indir.jpg'},
        {id: 4, name: '猫猫4', age: "6岁", location: '南京', imageUrl: 'src/views/assets/img/indir.jpg'},
        {id: 5, name: '猫猫5', age: "6岁", location: '南京', imageUrl: 'src/views/assets/img/cat1.jpg'},
      ],
      index: 0
    };
  },
  mounted() {
    this.index = router.currentRoute.value.query.index;
    console.log(this.index)
    request({
      url: `http://localhost:8080/pets`,
      method: 'GET'
    }).then((res) => {
      console.log(res.data)
      this.pets=res.data
    }).catch((error) => {
    })
  }
}

</script>

<style scoped>


.button1 {
  display: flex;
  font-size: 20px;
  width: 160px;
  height: 40px;
  background-color: #fff;
  color: #6504B5;
  margin-left: 15%;
  margin-top: 8px;
  border: 2px solid #6504B5;
}
.button1:hover {
  background-color: #2e0152;
  border: 2px solid #2e0152;
  color: white;
}
.button1 .icon {
  fill: #6504B5; /* 设置默认填充颜色为 #6504B5 */
}
.button1:hover .icon {
  fill: white; /* 设置鼠标悬停时的填充颜色为白色 */
}

.share {
  width: 20%;
  height: 50px;
  border: transparent;
}
.share:hover {
  background: transparent;
  //border: 2px solid #6504B5;
}
.recent{
  text-align: center;
  margin-top: 20px;
  padding-bottom: 100px;
}

.recent-text{
  line-height: 1.2;
  color: #6504b5;
  text-align: center;
  display: block;
  font-family: Nexa Regular,arial,helvetica,sans-serif;
  font-size: 30px;
}

.rec-cards{
  display: flex;
  justify-content: center;
  text-align: center;
  margin-top: 20px;
}

.article-card{
  height: 70%;
  text-align: center;
  border-radius: 10px;
  margin-left: 20px;
}
.contentcontainer {
  width: 90%;
  padding: 50px;
  display: flex;
  margin-top: 50px;
}
.contentdiv {
  margin: 0 auto;
  width: 85%;
  text-align: left;
}
.article-title{
  font-weight: 600;
  color: #4d4751;
  display: block;
  font-family: Nexa Regular,arial,helvetica,sans-serif;
  font-size: 30px;
  line-height: 1.2;
}
.article-img{
  width: 600px;
}
.article-content{
  margin-top: 20px;
  text-align: left;
  line-height: 35px;
  white-space: pre-line;
  font-size: 20px;
}
</style>